/*
git init - включаем гит
git add . - добавление всех файлов в оперативу гит
git status - просмотр статуса файлов (отображает измененные файлы)
git commit -m 'комментарий' - сохранение коммита
git log - просмотр сделанных коммитов
git checkout + номер коммита - просмотр что сделано в коммите
git checkout master - возврат к последней версии коммита

git revert + номер коммита - отменить коммит (не удаляет)
=> попадаем в вим => :wq - выход из вима

git reset + id коммита --hard - удаление коммита до укзаного id

работа веток

git branch + название ветки - создание ветки
git checkout + название ветки - перейти на созданную ветку
git checkout -b + название - создать ветку и сразу перейти на нее
git branch -a - посмотреть все ветки проекта
git checkout master - возврат на главную ветку

git merge + название - сливаем основную ветку и дополнительную

*/